mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_S2/ESP32_S2_TFT_graphicstest_240x280/ESP32_S2_TFT_graphicstest_240x280.ino
	uint32_t usecFilledTrangles = testFilledTriangles();
	Serial.print(F("Triangles (filled)       "));
	Serial.println(usecFilledTrangles);
	delay(500);

	uint32_t usecRoundRects = testRoundRects();
	Serial.print(F("Rounded rects (outline)  "));
	Serial.println(usecRoundRects);
	delay(500);

	uint32_t usedFilledRoundRects = testFilledRoundRects();
	Serial.print(F("Rounded rects (filled)   "));
	Serial.println(usedFilledRoundRects);
	delay(500);

	Serial.println(F("Done!"));

	uint16_t c = 4;
	int8_t d = 1;
	for (int32_t i = 0; i < tft.height(); i++)
	{
		tft.drawFastHLine(0, i, tft.width(), c);
		c += d;
		if (c <= 4 || c >= 11)
			d = -d;
	}
	
	tft.setCursor(0, 0);
	tft.setTextColor(TFT_MAGENTA);
	tft.setTextSize(2);

	tft.print(F("   "));
 	tft.println(F("TFT_eSPI test"));

	tft.setTextSize(1);
/*
	tft.setTextColor(TFT_WHITE);
	tft.println(F(""));
	tft.setTextSize(1);
	tft.println(F(""));
	tft.setTextColor(tft.color565(0x80, 0x80, 0x80));

	tft.println(F(""));
*/

	tft.setTextColor(TFT_GREEN);
	tft.print(F("      "));
	tft.println(F("Benchmark       microseconds"));
	tft.println(F(""));
	tft.setTextColor(TFT_YELLOW);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("HaD pushColor "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecHaD);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Screen fill   "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecFillScreen);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Text          "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecText);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Pixels        "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecPixels);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Lines         "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecLines);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Hor/Vert Line "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecFastLines);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Rectangles    "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecRects);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Rect.-filled  "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecFilledRects);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Circles       "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecCircles);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Circ.-filled  "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecFilledCircles);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Triangles     "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecTriangles);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Triang-filled "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecFilledTrangles);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Rounded rects "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usecRoundRects);

	tft.setTextColor(TFT_CYAN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.print(F("Round R.-fill "));
	tft.setTextColor(TFT_YELLOW); tft.setTextSize(2);
	printnice(usedFilledRoundRects);

	tft.setTextSize(1);
	//tft.println(F(""));
	tft.setTextColor(TFT_GREEN); tft.setTextSize(1);
	tft.print(F("      "));
	tft.println(F("Benchmark Complete!"));
  //tft.println(F(""));

	delay(10 * 1000L);

  tft.fillScreen(TFT_BLACK);

	tft.setCursor(0, 40);
	tft.setTextColor(TFT_WHITE);
	tft.setTextSize(2);

  tft.print(F("Processor : ")); 
  #if defined(CONFIG_IDF_TARGET_ESP32S3)
    tft.println("ESP32-S3");
  #elif defined(CONFIG_IDF_TARGET_ESP32S2)
    tft.println("ESP32-S2");
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    tft.println("ESP32-C3");  
  #elif defined (ESP32)
    tft.println("ESP32");  
  #elif defined (ARDUINO_ARCH_ESP8266)
    tft.println("ESP8266");  
  #elif defined (STM32)
    tft.println("STM32");  
  #elif defined(ARDUINO_ARCH_RP2040)
    tft.println("RP2040");  
  #elif defined(__LGT8FX8P__)
    tft.println("LGT8FX");  
  #else
    tft.println("Arduino");
  #endif
  tft.setCursor(tft.getCursorX(), tft.getCursorY()+4); 


  tft.print(F("ESP32     : ")); 
  tft.print(ESP_ARDUINO_VERSION_MAJOR); 
  tft.print("."); 
  tft.print(ESP_ARDUINO_VERSION_MINOR); 
  tft.print("."); 
  tft.print(ESP_ARDUINO_VERSION_PATCH); 
  //tft.print(" 0x"); 
  //tft.print(ESP_ARDUINO_VERSION,HEX); 
  tft.println("");
  tft.setCursor(tft.getCursorX(), tft.getCursorY()+2); 

  tft.print(F("TFT_eSPI  : ")); 
  tft.println(TFT_ESPI_VERSION);
  tft.setCursor(tft.getCursorX(), tft.getCursorY()+2);
  
  tft.print(F("SPI Write : ")); 
  tft.print(SPI_FREQUENCY/1000000);
  tft.println(F(" MHz")); 
  tft.setCursor(tft.getCursorX(), tft.getCursorY()+8);

  tft.print(F("MOSI ")); 
  tft.print(TFT_MOSI);
  if (TFT_MOSI != MOSI) {
    tft.print(F("/")); 
    tft.print(MOSI);
  }  
  tft.print(F("  CS  ")); 
  tft.print(TFT_CS);
  if (TFT_CS != SS) {
    tft.print(F("/")); 
    tft.print(SS);
  }
  tft.println("");
  tft.setCursor(tft.getCursorX(), tft.getCursorY()+2);

  tft.print(F("MISO ")); 
  tft.print(TFT_MISO);
  if (TFT_MISO != MISO) {
    tft.print(F("/")); 
    tft.print(MISO);
  }
  tft.print(F("  DC  ")); 
  tft.print(TFT_DC);
  tft.println("");
  tft.setCursor(tft.getCursorX(), tft.getCursorY()+2);

  tft.print(F("SCLK ")); 
  tft.print(TFT_SCLK);
  if (TFT_SCLK != SCK) {
    tft.print(F("/")); 
    tft.print(SCK);
  }
  tft.print(F("  RST ")); 
  tft.print(TFT_RST);
  tft.println("");
  tft.setCursor(tft.getCursorX(), tft.getCursorY()+2);

