mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_S2/ESP32_S2_TFT_graphicstest_240x280/ESP32_S2_TFT_graphicstest_240x280.ino
Bodmer's TFT_eSPI library Test!
no #define USE_xSPI_PORT
FSPI : 0
HSPI : 1
VSPI : 0
SPI_PORT : 2
SPI2_HOST : 1
DR_REG_SPI1_BASE : 0x60002000
DR_REG_SPI2_BASE : 0x60024000
REG_SPI_BASE(2) : 0x60024000
REG_SPI_BASE(1) : 0x60002000
start tft.init() 
[   578][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008cae
[   591][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 7 successfully set to type GPIO (1) with bus 0x8
[   601][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008cae
[   612][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 19 successfully set to type GPIO (1) with bus 0x14
[   622][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type SPI_MASTER_SCK (34) successfully set to 0x4200b5bc
[   634][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type SPI_MASTER_MISO (35) successfully set to 0x4200b4b6
[   646][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type SPI_MASTER_MOSI (36) successfully set to 0x4200b3ae
[   658][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type SPI_MASTER_SS (37) successfully set to 0x4200b376
[   670][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008cae
[   681][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 4 successfully set to type GPIO (1) with bus 0x5
[   691][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 4 successfully set to type SPI_MASTER_SCK (34) with bus 0x1
[   701][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008cae
[   712][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 5 successfully set to type GPIO (1) with bus 0x6
[   722][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 5 successfully set to type SPI_MASTER_MISO (35) with bus 0x1
[   733][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008cae
   744][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 6 successfully set to type GPIO (1) with bus 0x7
[   754][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 6 successfully set to type SPI_MASTER_MOSI (36) with bus 0x1
done tft.init() 
[  1299][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008cae
[  1311][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 18 successfully set to type GPIO (1) with bus 0x13
[  1837][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 18 successfully set to type INIT (0) with bus 0x0
[  1847][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type LEDC (9) successfully set to 0x42008f08
[  1858][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 18 successfully set to type LEDC (9) with bus 0x3fc92a38
[  1868][I][esp32-hal-ledc.c:117] ledcAttachChannel(): LEDC attached to pin 18 (channel 0, resolution 8)
=========== After Setup Start ============
INTERNAL Memory Info:
------------------------------------------
  Total Size        :   333064 B ( 325.3 KB)
  Free Bytes        :   304232 B ( 297.1 KB)
  Allocated Bytes   :    24704 B (  24.1 KB)
  Minimum Free Bytes:   300996 B ( 293.9 KB)
  Largest Free Block:   163828 B ( 160.0 KB)
------------------------------------------
GPIO Info:
------------------------------------------
  GPIO : BUS_TYPE[bus/unit][chan]
  --------------------------------------  
     4 : SPI_MASTER_SCK[0]
     5 : SPI_MASTER_MISO[0]
     6 : SPI_MASTER_MOSI[0]
     7 : GPIO
    18 : LEDC[0][0]
    19 : GPIO
    20 : UART_RX[0]
    21 : UART_TX[0]
============ After Setup End =============
Processor : ESP32-C3
ESP32     : 3.0.2
TFT_eSPI  : 2.5.43
SPI Write : 80 MHz
no #define USE_xSPI_PORT
MOSI 6 - MISO 5 - SCLK 4 - CS  7 - DC  19 - RST -1
Benchmark                Time (microseconds)
HaD pushColor            81182
Screen fill              14497
Text                     15424
Pixels                   241329
Lines                    261918
Horiz/Vert Lines         7317
Rectangles (outline)     5380
Rectangles (filled)      172310
Circles (filled)         33952
Circles (outline)        24865
Triangles (outline)      17986
Triangles (filled)       69931
Rounded rects (outline)  14623
Rounded rects (filled)   177987
Done!

Processor : ESP32-C3
ESP32     : 3.0.2
TFT_eSPI  : 2.5.43
SPI Write : 80 MHz
no #define USE_xSPI_PORT
MOSI 6 - MISO 5 - SCLK 4 - CS  7 - DC  19 - RST -1
Benchmark                Time (microseconds)
HaD pushColor            81159
Screen fill              14498
Text                     15418
Pixels                   241329
Lines                    261915
Horiz/Vert Lines         7318
Rectangles (outline)     5380
Rectangles (filled)      172303
Circles (filled)         33952
Circles (outline)        24866
Triangles (outline)      17983
Triangles (filled)       69931
Rounded rects (outline)  14623
Rounded rects (filled)   177983
Done!


Alt :
=========================================================================================================================

ESP32 2.0.14 DIO ! :

Funktioniert auch mit modifizierter TFT_eSPI_ESP32_C3.h :
  ESP32 2.0.14 + TFT_eSPI 2.5.43, DIO, !!! nur ohne "#define USE_HSPI_PORT" !!!
  ESP32 2.0.14 + TFT_eSPI 2.5.43, DIO, mit #define USE_FSPI_PORT oder #define USE_VSPI_PORT
Geht nicht :  
  mit "#define USE_HSPI_PORT" Display schwarz, Serial Monitor Benchmark :  Werte zu klein, SDA und SCK beide konstant bei 3.3V


ESP32 2.0.17 DIO !, mit modifizierter TFT_eSPI_ESP32_C3.h :

Kernel panic 
  ESP32 2.0.17 + TFT_eSPI 2.5.43, DIO, ohne "#define USE_xSPI_PORT"
  ESP32 2.0.17 + TFT_eSPI 2.5.43, DIO, "#define USE_HSPI_PORT"
  ESP32 2.0.17 + TFT_eSPI 2.5.43, DIO, "#define USE_FSPI_PORT"
  ESP32 2.0.17 + TFT_eSPI 2.5.43, DIO, "#define USE_VSPI_PORT"


ESP32 3.0.2 DIO !, mit modifizierter TFT_eSPI_ESP32_C3.h :

Kernel panic 
  ESP32 3.0.2 + TFT_eSPI 2.5.43, DIO, "#define USE_VSPI_PORT"

crasht in tft.init();
  ESP32 3.0.2 + TFT_eSPI 2.5.43, DIO, ohne "#define USE_xSPI_PORT"
  ESP32 3.0.2 + TFT_eSPI 2.5.43, DIO, "#define USE_FSPI_PORT"


  ESP32 3.0.2 + TFT_eSPI 2.5.43, DIO, "#define USE_HSPI_PORT" mit(ohne) modifizierter TFT_eSPI_ESP32_C3.h
Funktioniert etwas, crasht nicht in tft_init, aber Display bleibt schwarz und
Serial Monitor Benchmark-Werte zu klein, 
SCK konstant bei 0V und SDA konstant bei 3.3V = Pins werden nicht angesteuert
  ESP32 3.0.2 + TFT_eSPI 2.5.43, DIO, "#define USE_HSPI_PORT"

