mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_S2/ESP32_S2_TFT_graphicstest_240x280/ESP32_S2_TFT_graphicstest_240x280.ino
-------------------------------------------------------------------------------------------------------------------------
TFT_BL -1 verbose  ( ->   //#define TFT_BL ...

Guru Meditation Error: Core  0 panic'ed (Store access fault). Exception was unhandled.
-------------------------------------------------------------------------------------------------------------------------
Debug Verbose : ESP32 3.0.2 + TFT_eSPI 2.5.43, DIO, "#define USE_HSPI_PORT" mit(ohne) modifizierter TFT_eSPI_ESP32_C3.h

ESP-ROM:esp32c3-api1-20210207 ESP32 3.0.2 + TFT_eSPI 2.5.43, DIO, "#define USE_HSPI_PORT" 
Build:Feb  7 2021
rst:0x1 (POWERON),boot:0xc (SPI_FAST_FLASH_BOOT)
SPIWP:0xee
mode:DIO, clock div:1
load:0x3fcd5820,len:0x3ac
load:0x403cc710,len:0x6c4
load:0x403ce710,len:0x2788
entry 0x403cc710
[   101][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_RX (2) successfully set to 0x4200c0fe
[   112][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_TX (3) successfully set to 0x4200c0c2
[   124][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_CTS (4) successfully set to 0x4200c086
[   135][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_RTS (5) successfully set to 0x4200c04a
[   147][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_RX (2) successfully set to 0x4200c0fe
[   158][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_TX (3) successfully set to 0x4200c0c2
[   169][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_CTS (4) successfully set to 0x4200c086
[   181][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_RTS (5) successfully set to 0x4200c04a
E (195) esp_core_dump_flash: Core dump data check failed:                                         jetzt nicht mehr ? BL -1            ???? 
Calculated checksum='08099a69'                                                                                                        ????
Image checksum='ffffffff'                                                                                                             ????
[   200][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 20 successfully set to type UART_RX (2) with bus 0x3fc8ca90
[   216][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 21 successfully set to type UART_TX (3) with bus 0x3fc8ca90
=========== Before Setup Start ===========
Chip Info:
------------------------------------------
  Model             : ESP32-C3
  Package           : 0
  Revision          : 3
  Cores             : 1
  CPU Frequency     : 160 MHz
  XTAL Frequency    : 40 MHz
  Embedded Flash    : No
  Embedded PSRAM    : No
  2.4GHz WiFi       : Yes
  Classic BT        : No
  BT Low Energy     : Yes
  IEEE 802.15.4     : No
------------------------------------------
INTERNAL Memory Info:
------------------------------------------
  Total Size        :   333032 B ( 325.2 KB)
  Free Bytes        :   301464 B ( 294.4 KB)
  Allocated Bytes   :    27776 B (  27.1 KB)
  Minimum Free Bytes:   301324 B ( 294.3 KB)
  Largest Free Block:   163828 B ( 160.0 KB)
------------------------------------------
Flash Info:
------------------------------------------
  Chip Size         :  4194304 B (4 MB)
  Block Size        :    65536 B (  64.0 KB)
  Sector Size       :     4096 B (   4.0 KB)
  Page Size         :      256 B (   0.2 KB)
  Bus Speed         : 80 MHz
  Bus Mode          : DIO
------------------------------------------
Partitions Info:
------------------------------------------
                nvs : addr: 0x00009000, size:    20.0 KB, type: DATA, subtype: NVS
            otadata : addr: 0x0000E000, size:     8.0 KB, type: DATA, subtype: OTA
               app0 : addr: 0x00010000, size:  1280.0 KB, type:  APP, subtype: OTA_0
               app1 : addr: 0x00150000, size:  1280.0 KB, type:  APP, subtype: OTA_1
             spiffs : addr: 0x00290000, size:  1408.0 KB, type: DATA, subtype: SPIFFS
           coredump : addr: 0x003F0000, size:    64.0 KB, type: DATA, subtype: COREDUMP
------------------------------------------
Software Info:
------------------------------------------
  Compile Date/Time : Jul  6 2024 21:09:42
  Compile Host OS   : windows
  ESP-IDF Version   : v5.1.4-358-gbd2b9390ef-dirty
  Arduino Version   : 3.0.2
------------------------------------------
Board Info:
------------------------------------------
  Arduino Board     : ESP32C3_DEV
  Arduino Variant   : esp32c3
  Arduino FQBN      : esp32:esp32:esp32c3:UploadSpeed=921600,CDCOnBoot=default,CPUFreq=160,FlashFreq=80,FlashMode=dio,FlashSize=4M,PartitionScheme=default,DebugLevel=verbose,EraseFlash=none,JTAGAdapter=default,ZigbeeMode=default
============ Before Setup End ============
[   541][V][esp32-hal-uart.c:408] uartBegin(): UART0 baud(115200) Mode(800001c) rxPin(20) txPin(21)
[   550][V][esp32-hal-uart.c:497] uartBegin(): UART0 not installed. Starting installation
[   559][V][esp32-hal-uart.c:544] uartBegin(): UART0 initialization done.

Bodmer's TFT_eSPI library Test!
1: start tft.init() 
[   566][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008736
[   581][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 7 successfully set to type GPIO (1) with bus 0x8
[   591][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008736
[   602][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 19 successfully set to type GPIO (1) with bus 0x14
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
[  1140][E][esp32-hal-periman.c:180] perimanGetPinBus(): Invalid pin: 255
[  1147][E][esp32-hal-gpio.c:166] __digitalWrite(): IO 255 is not set as GPIO.
[  1154][E][esp32-hal-gpio.c:103] __pinMode(): Invalid IO 255 selected

oder :

