mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_S2/ESP32_S2_TFT_graphicstest_240x280/ESP32_S2_TFT_graphicstest_240x280.ino
  Guru Meditation Error: Core  0 panic'ed (Store access fault). Exception was unhandled.
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????

9: done tft.init() 
[  1160][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type GPIO (1) successfully set to 0x42008736
[  1173][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 18 successfully set to type GPIO (1) with bus 0x13
[  1686][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 18 successfully set to type INIT (0) with bus 0x0
[  1696][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type LEDC (9) successfully set to 0x42008990
[  1707][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 18 successfully set to type LEDC (9) with bus 0x3fc929d4
[  1718][I][esp32-hal-ledc.c:117] ledcAttachChannel(): LEDC attached to pin 18 (channel 0, resolution 8)
=========== After Setup Start ============
INTERNAL Memory Info:
------------------------------------------
  Total Size        :   333032 B ( 325.2 KB)
  Free Bytes        :   304332 B ( 297.2 KB)
  Allocated Bytes   :    24604 B (  24.0 KB)
  Minimum Free Bytes:   300864 B ( 293.8 KB)
  Largest Free Block:   163828 B ( 160.0 KB)
------------------------------------------
GPIO Info:
------------------------------------------
  GPIO : BUS_TYPE[bus/unit][chan]
  --------------------------------------  
     7 : GPIO
    18 : LEDC[0][0]
    19 : GPIO
    20 : UART_RX[0]
    21 : UART_TX[0]
============ After Setup End =============

Benchmark                Time (microseconds)
HaD pushColor            20773
Screen fill              671
Text                     31014
Pixels                   160081
Lines                    199347
Horiz/Vert Lines         12398
Rectangles (outline)     5439
Rectangles (filled)      11251
Circles (filled)         34027
Circles (outline)        36272
Triangles (outline)      18906
Triangles (filled)       20260
Rounded rects (outline)  23623
Rounded rects (filled)   17236
Done!

Benchmark                Time (microseconds)
HaD pushColor            20775
...
-------------------------------------------------------------------------------------------------------------------------
Debug Verbose : ESP32 2.0.14 + TFT_eSPI 2.5.43, DIO, !! ohne !! "#define USE_HSPI_PORT" ohne modifizierter TFT_eSPI_ESP32_C3.h

ESP-ROM:esp32c3-api1-20210207
Build:Feb  7 2021
rst:0x1 (POWERON),boot:0xc (SPI_FAST_FLASH_BOOT)
SPIWP:0xee
mode:DIO, clock div:1
load:0x3fcd5810,len:0x38c
load:0x403cc710,len:0x6a0
load:0x403ce710,len:0x25f4
entry 0x403cc710
E (100) esp_core_dump_flash: Core dump data check failed��                                   ??????
Bodmer's TFT_eSPI library Test!
1: start tft.init() 
E (718) gpio: gpio_set_level(227): GPIO output gpio_num error                                  ????  TFT_BL -1  mag er nicht !!
[   667][E][esp32-hal-gpio.c:102] __pinMode(): Invalid pin selected                            ????  dito
9: done tft.init() 
[  1222][V][esp32-hal-ledc.c:231] analogWrite(): GPIO 18 - Using Channel 5, Value = 255
[  1232][V][esp32-hal-ledc.c:231] analogWrite(): GPIO 18 - Using Channel 5, Value = 254
...
[  5032][V][esp32-hal-ledc.c:231] analogWrite(): GPIO 18 - Using Channel 5, Value = 126
[  5042][V][esp32-hal-ledc.c:231] analogWrite(): GPIO 18 - Using Channel 5, Value = 127

Benchmark                Time (microseconds)
HaD pushColor            212027
Screen fill              41385
Text                     23026
Pixels                   347133
Lines                    395849
Horiz/Vert Lines         18464
Rectangles (outline)     13319
Rectangles (filled)      491309
Circles (filled)         64166
Circles (outline)        37315
Triangles (outline)      27540
Triangles (filled)       172906
Rounded rects (outline)  25548
Rounded rects (filled)   496731
Done!

----------------------------------------------------------------------------------------------------------

ESP32 3.0.2 + TFT_eSPI 2.5.43 DIO Verbose

SP-ROM:esp32c3-api1-20210207
Build:Feb  7 2021
rst:0x1 (POWERON),boot:0xc (SPI_FAST_FLASH_BOOT)
SPIWP:0xee
mode:DIO, clock div:1
load:0x3fcd5820,len:0x3ac
load:0x403cc710,len:0x6c4
load:0x403ce710,len:0x2788
entry 0x403cc710
[   101][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_RX (2) successfully set to 0x4200c10e
[   112][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_TX (3) successfully set to 0x4200c0d2
[   124][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_CTS (4) successfully set to 0x4200c096
[   135][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_RTS (5) successfully set to 0x4200c05a
[   147][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_RX (2) successfully set to 0x4200c10e
[   158][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_TX (3) successfully set to 0x4200c0d2
[   169][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_CTS (4) successfully set to 0x4200c096
[   181][V][esp32-hal-periman.c:235] perimanSetBusDeinit(): Deinit function for type UART_RTS (5) successfully set to 0x4200c05a
[   201][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 20 successfully set to type UART_RX (2) with bus 0x3fc8ca90
[   212][V][esp32-hal-periman.c:160] perimanSetPinBus(): Pin 21 successfully set to type UART_TX (3) with bus 0x3fc8ca90
=========== Before Setup Start ===========
Chip Info:
------------------------------------------
  Model             : ESP32-C3
  Package           : 0
  Revision          : 3
  Cores             : 1
  CPU Frequency     : 160 MHz
  XTAL Frequency    : 40 MHz
  Embedded Flash    : No
  Embedded PSRAM    : No
  2.4GHz WiFi       : Yes
  Classic BT        : No
  BT Low Energy     : Yes
  IEEE 802.15.4     : No
------------------------------------------
INTERNAL Memory Info:
------------------------------------------
  Total Size        :   333064 B ( 325.3 KB)
  Free Bytes        :   301596 B ( 294.5 KB)
  Allocated Bytes   :    27692 B (  27.0 KB)
  Minimum Free Bytes:   301456 B ( 294.4 KB)
  Largest Free Block:   163828 B ( 160.0 KB)
------------------------------------------
Flash Info:
------------------------------------------
  Chip Size         :  4194304 B (4 MB)
  Block Size        :    65536 B (  64.0 KB)
  Sector Size       :     4096 B (   4.0 KB)
  Page Size         :      256 B (   0.2 KB)
  Bus Speed         : 80 MHz
  Bus Mode          : DIO
------------------------------------------
Partitions Info:
------------------------------------------
                nvs : addr: 0x00009000, size:    20.0 KB, type: DATA, subtype: NVS
            otadata : addr: 0x0000E000, size:     8.0 KB, type: DATA, subtype: OTA
               app0 : addr: 0x00010000, size:  1280.0 KB, type:  APP, subtype: OTA_0
               app1 : addr: 0x00150000, size:  1280.0 KB, type:  APP, subtype: OTA_1
             spiffs : addr: 0x00290000, size:  1408.0 KB, type: DATA, subtype: SPIFFS
           coredump : addr: 0x003F0000, size:    64.0 KB, type: DATA, subtype: COREDUMP
------------------------------------------
Software Info:
------------------------------------------
  Compile Date/Time : Jul  6 2024 16:16:26
  Compile Host OS   : windows
  ESP-IDF Version   : v5.1.4-358-gbd2b9390ef-dirty
  Arduino Version   : 3.0.2
------------------------------------------
Board Info:
------------------------------------------
  Arduino Board     : ESP32C3_DEV
  Arduino Variant   : esp32c3
  Arduino FQBN      : esp32:esp32:esp32c3:UploadSpeed=921600,CDCOnBoot=default,CPUFreq=160,FlashFreq=80,FlashMode=dio,FlashSize=4M,PartitionScheme=default,DebugLevel=verbose,EraseFlash=none,JTAGAdapter=default,ZigbeeMode=default
============ Before Setup End ============
[   536][V][esp32-hal-uart.c:408] uartBegin(): UART0 baud(115200) Mode(800001c) rxPin(20) txPin(21)
[   545][V][esp32-hal-uart.c:497] uartBegin(): UART0 not installed. Starting installation
[   553][V][esp32-hal-uart.c:544] uartBegin(): UART0 initialization done.

